import Foundation

struct KeyboardLayouts {
    static let qwerty = [
        ["q", "w", "e", "r", "t", "y", "u", "i", "o", "p"],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l"],
        ["z", "x", "c", "v", "b", "n", "m"]
    ]
    
    static let qwertz = [
        ["q", "w", "e", "r", "t", "z", "u", "i", "o", "p"],
        ["a", "s", "d", "f", "g", "h", "j", "k", "l"],
        ["y", "x", "c", "v", "b", "n", "m"]
    ]
    
    static let azerty = [
        ["a", "z", "e", "r", "t", "y", "u", "i", "o", "p"],
        ["q", "s", "d", "f", "g", "h", "j", "k", "l"],
        ["w", "x", "c", "v", "b", "n", "m"]
    ]
    
    static let symbols = [
        ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0"],
        ["-", "/", ":", ";", "(", ")", "$", "&", "@", "\""],
        [".", ",", "?", "!", "'"]
    ]
    
    static let keyAlternates: [String: [String]] = [
        "e": ["e", "é", "è", "ê", "ë"],
        "a": ["a", "à", "â", "ä", "æ"],
        "i": ["i", "í", "ì", "î", "ï"],
        "o": ["o", "ó", "ò", "ô", "ö", "œ"],
        "u": ["u", "ú", "ù", "û", "ü"],
        "c": ["c", "ç"],
        "n": ["n", "ñ"]
    ]
}
